# using string patterns and ranges

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
cnn = sql.connect('test.db')

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///test.db

##  % (wild card character) is used to for missing elements

In [10]:
%%sql 
select * from people where name like'%a%'

 * sqlite:///test.db
Done.

[(0, 'amruth', 23, 'richardson'),
 (1, 'akshath', 34, 'bangalore'),
 (2, 'sharath', 32, 'tonoto')]

# Range
- and
- between

In [11]:
%%sql
select * from people where age>=30 and age<=40

 * sqlite:///test.db
Done.

[(1, 'akshath', 34, 'bangalore'), (2, 'sharath', 32, 'tonoto')]

In [12]:
%%sql
select * from people where age between 30 and 40

 * sqlite:///test.db
Done.

[(1, 'akshath', 34, 'bangalore'), (2, 'sharath', 32, 'tonoto')]

In [20]:
%%sql
SELECT * from sqlite_master WHERE type='table' limit 5

 * sqlite:///test.db
Done.

[('table', 'people', 'people', 2, 'CREATE TABLE "people" (\n"index" INTEGER,\n  "name" TEXT,\n  "age" INTEGER,\n  "city" TEXT\n)'),
 ('table', 'PETSALE', 'PETSALE', 4, 'CREATE TABLE PETSALE (\n        ID INTEGER NOT NULL,\n        PET CHAR(20),\n        SALEPRICE DECIMAL(6,2),\n        SALEDATE DATE\n        , quantity integer)'),
 ('table', 'PET', 'PET', 5, 'CREATE TABLE PET (\n        ID INTEGER NOT NULL,\n        ANIMAL VARCHAR(20),\n        QUANTITY INTEGER\n        )'),
 ('table', 'PATIENTS', 'PATIENTS', 6, 'CREATE TABLE PATIENTS (\n  PATIENT_ID CHAR(9) NOT NULL,\n  FIRST_NAME VARCHAR(15) NOT NULL,\n  LAST_NAME VARCHAR(15) NOT NULL,\n  SSN CHAR(9),\n  BIRTH_DATE DATE,\n  SEX CHAR,\n  ADDRESS VARCHAR(30),\n  DEPT_ID CHAR(9) NOT NULL,\n  PRIMARY KEY (PATIENT_ID)\n)'),
 ('table', 'MEDICAL_HISTORY', 'MEDICAL_HISTORY', 8, 'CREATE TABLE MEDICAL_HISTORY (\n  MEDICAL_HISTORY_ID CHAR(9) NOT NULL,\n  PATIENT_ID CHAR(9) NOT NULL,\n  DIAGNOSIS_DATE DATE,\n  DIAGNOSIS_CODE VARCHAR(10),\n  MEDICAL_CONDITION VARCHAR(100),\n  DEPT_ID CHAR(9),\n  PRIMARY KEY (MEDICAL_HISTORY_ID)\n)')]

# IN
eg: select * from author where country in ('AU','BR')